app/views/login/index.html.erb

  <%@questions.each do |questions| %>
  <%@options=Option.where("question_id=?",questions.id.to_i) %>
---
SELECT `options`.* FROM `options` WHERE (question_id=1)